{
  "backend/main.mo": "Motoko canister defining user profiles, transfers, cards, loans, insurance, and EMI plans with access control and CRUD-style functions.",
  "feature_evidence.json": "Machine‑generated report mapping implemented features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file for planning and documentation.",
  "frontend/index.css": "Tailwind-based global theme defining OKLCH color variables, dark mode values, and base styling tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with authenticated layout and routes for all banking pages.",
  "frontend/src/components/AppLayout.tsx": "Main authenticated layout with header, navigation, user badge, and responsive menu wrapping page content.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading and error handling.",
  "frontend/src/components/Auth/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to fill and submit their profile details.",
  "frontend/src/components/common/QueryState.tsx": "Provides reusable loading, empty, and error UI components with optional retry and actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity authentication, storing identity and managing login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, transfers, cards, loans, and other backend operations using the actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for a light and dark banking theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CardsPage.tsx": "Renders a card management page allowing users to view, add, and delete debit or credit cards.",
  "frontend/src/pages/CompoundInterestPage.tsx": "A calculator page that lets users input investment parameters and computes compound interest using utility functions.",
  "frontend/src/pages/DashboardPage.tsx": "Fetches and displays a financial overview including stats and recent transfers with links to detailed sections.",
  "frontend/src/pages/EmiPage.tsx": "Provides an EMI calculator with rate options and allows saving calculated EMI plans to the backend.",
  "frontend/src/pages/InsurancePage.tsx": "Shows selectable insurance categories and a form to submit insurance inquiries, with backend integration and validation.",
  "frontend/src/pages/LoansPage.tsx": "Displays loan application tabs for different loan types and submits applications after validating user inputs.",
  "frontend/src/pages/LoginPage.tsx": "Renders the landing/login page with Internet Identity sign‑in and a feature overview section. Uses UI components and branding elements for the 9 Sea Bank homepage.",
  "frontend/src/pages/MoneyTransferPage.tsx": "Provides a form to submit new money transfers with validation and displays transfer history using backend queries. Includes toast notifications and UI elements for statuses and formatting.",
  "frontend/src/utils/finance.ts": "Implements financial utilities including compound interest, EMI calculations, and helpers for currency, number, and date formatting. Used across the app for consistent financial computations.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values. Supports both query and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the app’s UI design system. Extends utilities and defines design tokens used throughout the frontend.",
  "project_state.json": "Tracks project metadata, implemented features, requirements, issues, and image needs for the 9 Sea Bank application."
}